RT2#
*Jul 11 12:48:40.999: %GRUB-5-CONFIG_WRITING: GRUB configuration is being updated on disk. Please wait...
*Jul 11 12:48:41.674: %GRUB-5-CONFIG_WRITTEN: GRUB configuration was written to disk successfully.show ipv6 route eigrp 
IPv6 Routing Table - default - 9 entries
Codes: C - Connected, L - Local, S - Static, U - Per-user Static route
       B - BGP, HA - Home Agent, MR - Mobile Router, R - RIP
       H - NHRP, I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea
       IS - ISIS summary, D - EIGRP, EX - EIGRP external, NM - NEMO
       ND - ND Default, NDp - ND Prefix, DCE - Destination, NDr - Redirect
       RL - RPL, O - OSPF Intra, OI - OSPF Inter, OE1 - OSPF ext 1
       OE2 - OSPF ext 2, ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       la - LISP alt, lr - LISP site-registrations, ld - LISP dyn-eid
       lA - LISP away, a - Application
D   ::/0 [90/15360]
     via FE80::1, GigabitEthernet0/1
D   2001:DBB:1::/48 [90/15360]
     via FE80::1, GigabitEthernet0/1
D   2001:DBB:2::/48 [5/1280]
     via Null0, directly connected
RT2#conf 
RT2#configure 
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
RT2(config)#ipv6 prefix-list BLOCK-DEFAULT seq 5 deny ::/0
RT2(config)#ipv6 prefix-list BLOCK-DEFAULT seq 10 permit ::/0 le 128
RT2(config)#router eigrp NAMED-MODE                                 
RT2(config-router)#address-family ipv6 unicast autonomous-system 100       
RT2(config-router-af)#af-interface gigabitEthernet 0/1                 
RT2(config-router-af-interface)#topo
RT2(config-router-af-interface)#exit
RT2(config-router-af)#topo
RT2(config-router-af)#topology ba
RT2(config-router-af)#topology base 
RT2(config-router-af-topology)#di
RT2(config-router-af-topology)#distri
RT2(config-router-af-topology)#distribute-list pr
RT2(config-router-af-topology)#$list prefix-list BLOCK-DEFAULT in gi         
RT2(config-router-af-topology)#$x-list BLOCK-DEFAULT in gigabitEthernet 0/1
RT2(config-router-af-topology)#exi
RT2(config-router-af-topology)#exit-af-topology 
RT2(config-router-af)#e
RT2(config-router-af)#ex
RT2(config-router-af)#exit-address-family 
RT2(config-router)#end
RT2#wr
Building configuration...
[OK]
*Jul 11 12:52:17.861: %SYS-5-CONFIG_I: Configured from console by console
RT2#
RT2#
RT2#
RT2#
RT2#
RT2#
*Jul 11 12:52:19.001: %GRUB-5-CONFIG_WRITING: GRUB configuration is being updated on disk. Please wait...
*Jul 11 12:52:19.241: %DUAL-5-NBRCHANGE: EIGRP-IPv6 100: Neighbor FE80::1 (GigabitEthernet0/1) is resync: intf route configuration changed
*Jul 11 12:52:19.660: %GRUB-5-CONFIG_WRITTEN: GRUB configuration was written to disk successfully.show ipv6 route eigrp 
IPv6 Routing Table - default - 8 entries
Codes: C - Connected, L - Local, S - Static, U - Per-user Static route
       B - BGP, HA - Home Agent, MR - Mobile Router, R - RIP
       H - NHRP, I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea
       IS - ISIS summary, D - EIGRP, EX - EIGRP external, NM - NEMO
       ND - ND Default, NDp - ND Prefix, DCE - Destination, NDr - Redirect
       RL - RPL, O - OSPF Intra, OI - OSPF Inter, OE1 - OSPF ext 1
       OE2 - OSPF ext 2, ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       la - LISP alt, lr - LISP site-registrations, ld - LISP dyn-eid
       lA - LISP away, a - Application
D   2001:DBB:1::/48 [90/15360]
     via FE80::1, GigabitEthernet0/1
D   2001:DBB:2::/48 [5/1280]
     via Null0, directly connected
RT2#show run | sec ipv6 prefix  
ipv6 prefix-list BLOCK-DEFAULT seq 5 deny ::/0
ipv6 prefix-list BLOCK-DEFAULT seq 10 permit ::/0 le 128